ws.yml
config:
  target: "wss://uat.cashinero.co/api/v2/ranger/public/?stream=global.tickers"
  phases:
    - duration: 10
      arrivalRate: 100 # Every second, add 100 users
      rampTo: 300 # And ramp it up to 300 users in total over the 60s period
      name: "Ramping up the load"
    - duration: 120 # Then resume the load test for 120s
      arrivalRate: 300 # With those 300 users we ramped up to in the first phase
      rampTo: 300 # And keep it steady at 300 users
      name: "Pushing a constant load"
  ensure:
    maxErrorRate: 1
scenarios:
  - engine: "ws"
    flow:
      - send: '{"event":"subscribe","streams":["btcusdt.trades","btcusdt.ob-inc"]}' # Subscribe to the public channel
      - send: '{"event":"subscribe","streams":["ethusdt.trades","ethusdt.ob-inc"]}' # Subscribe to the public channel
      - send: '{"event":"subscribe","streams":["undbtc.trades","undbtc.ob-inc"]}' # Subscribe to the public channel
      - think: 15 # Every connection will remain open for 15s